Public Member Functions | Friends | List of all members
IFCAPI::PropertyTableValue Class Referencefinal
IFC Data Access
Represents an IfcPropertyTableValue. More...
#include <IFCProperty.hpp>
 Inheritance diagram for IFCAPI::PropertyTableValue:
 Public Member Functions
std::vector< IFCAPI::Value >  | GetDefiningValues () const
Get list of defining property values.
std::vector< IFCAPI::Value >  | GetDefinedValues () const
Get list of defined property values.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Property
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Represents an IfcPropertyTableValue.
Since
Archicad 28